Topkara11/ESP8266-Sending-Data-To-Framework-With-STM32F4-/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  * Written by GURKAN TOPKARA - 16.12.2021
  * gurkantopkara7@gmail.com
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f4xx_hal_uart.h"
/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;

UART_HandleTypeDef huart1;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_ADC1_Init(void);
static void MX_USART1_UART_Init(void);
/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
char sendBuff[80], sendBuff2[80],rx_buffer [40];
uint8_t recArr[80], recData;
uint8_t buffLen, buffLen2, buffCnt = 0;
uint16_t ADC_Value ;



const char API_KEY[] = 		"A1WNV4DDSG49HSBE"; // API KEY FROM  YOUR THINGSPEAKS PAGE
const char WIFI_NAME[] = 	"elfo11"; // Your wifi name
const char WIFI_PASSW[] = 	"elfotopkara11"; // Your password


int count=1;
 void ADC_Get_Value ()
{


	HAL_ADC_Start(&hadc1);

	if(HAL_ADC_PollForConversion(&hadc1,10000) == HAL_OK)
	{
		ADC_Value = HAL_ADC_GetValue(&hadc1);

	}
	HAL_ADC_Stop(&hadc1);
}



void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
{
	recArr[buffCnt++] = recData;
	if(buffCnt == 80) buffCnt = 0;
	HAL_UART_Receive_IT(&huart1, &recData, 1);
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */


  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_ADC1_Init();
  MX_USART1_UART_Init();
  /* USER CODE BEGIN 2 */



  // Wifi Connection

  buffLen = sprintf(sendBuff, "AT\r\n");
  HAL_UART_Transmit(&huart1, (uint8_t *)sendBuff, buffLen, 1000);
  HAL_Delay(2000);
  buffLen = sprintf(sendBuff, "ATE0\r\n");
  HAL_UART_Transmit(&huart1, (uint8_t *)sendBuff, buffLen, 1000);
  HAL_Delay(2000);
  buffLen = sprintf(sendBuff, "AT+CWQAP\r\n");
  HAL_UART_Transmit(&huart1, (uint8_t *)sendBuff, buffLen, 1000);
  HAL_Delay(2000);
  buffLen = sprintf(sendBuff, "AT+CWMODE=3\r\n");
  HAL_UART_Transmit(&huart1, (uint8_t *)sendBuff, buffLen, 1000);
  HAL_Delay(2000);
  buffLen = sprintf(sendBuff, "AT+CIPMODE=0\r\n");
  HAL_UART_Transmit(&huart1, (uint8_t *)sendBuff, buffLen, 1000);
  HAL_Delay(2000);
  buffLen = sprintf(sendBuff, "AT+CIPMUX=1\r\n");
  HAL_UART_Transmit(&huart1, (uint8_t *)sendBuff, buffLen, 1000);
  HAL_Delay(2000);

  buffLen = sprintf(sendBuff, "AT+CWDHCP=1,1\r\n");
  HAL_UART_Transmit(&huart1, (uint8_t *)sendBuff, buffLen, 1000);

  HAL_Delay(4000);


  buffLen = sprintf(sendBuff, "AT+CWLAP\r\n");
  HAL_UART_Transmit(&huart1, (uint8_t *)sendBuff, buffLen, 1000);
  HAL_Delay(3000);
  buffLen = sprintf(sendBuff, "AT+CWJAP=\"%s\",\"%s\"\r\n", WIFI_NAME, WIFI_PASSW);
  HAL_UART_Transmit(&huart1, (uint8_t *)sendBuff, buffLen, 1000);
  HAL_Delay(10000);
  buffLen = sprintf(sendBuff, "AT+RST\r\n");
  HAL_UART_Transmit(&huart1, (uint8_t *)sendBuff, buffLen, 1000);
  HAL_Delay(12000);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
	  ADC_Get_Value();

	  //Value_Buf[0] = ADC_Value;
	  //Value_Buf[1] = Voltage;
    /* USER CODE END WHILE */
	  // connect Thinkspeak server*/

	  buffLen = sprintf(sendBuff, "AT+CIPSTART=\"TCP\",\"184.106.153.149\",80\r\n");
	  HAL_UART_Transmit(&huart1, (uint8_t *)sendBuff, buffLen, 1000);
	  HAL_Delay(5000); // 8 idi
	  ADC_Get_Value();
	  // after connection to Thingspeak prepare data to send

	  buffLen = sprintf(sendBuff,"GET /update?api_key=A1WNV4DDSG49HSBE&field1=%u&field2=%d\r\n",ADC_Value,count); // ESP8266 sends the data to server by using this code.
	  buffLen2 = sprintf(sendBuff2, "AT+CIPSEND=%d\r\n", buffLen);

	  // send preapeared buffers to Thingspeak using ESP8266
	  HAL_UART_Transmit(&huart1, (uint8_t *)sendBuff2, buffLen2, 1000);
	  HAL_Delay(7000);
	  HAL_UART_Transmit(&huart1, (uint8_t *)sendBuff, buffLen, 1000);
	  count++;
	  HAL_Delay(7000);

	  // wait for 15sn to send new data
	  //HAL_Delay(10000);
	//  buffLen = sprintf(sendBuff, "AT+RST\r\n");
	 // HAL_UART_Transmit(&huart1, (uint8_t *)sendBuff, buffLen, 1000);
	 // HAL_Delay(12000);
    /* USER CODE BEGIN 3 */

  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  __HAL_RCC_PWR_CLK_ENABLE();
  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);
  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM = 4;
  RCC_OscInitStruct.PLL.PLLN = 180;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ = 7;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }
  /** Activate the Over-Drive mode
  */
  if (HAL_PWREx_EnableOverDrive() != HAL_OK)
  {
    Error_Handler();
  }
  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief ADC1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_ADC1_Init(void)
{

  /* USER CODE BEGIN ADC1_Init 0 */

  /* USER CODE END ADC1_Init 0 */

  ADC_ChannelConfTypeDef sConfig = {0};

  /* USER CODE BEGIN ADC1_Init 1 */

  /* USER CODE END ADC1_Init 1 */
  /** Configure the global features of the ADC (Clock, Resolution, Data Alignment and number of conversion)
  */
  hadc1.Instance = ADC1;
  hadc1.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV4;
  hadc1.Init.Resolution = ADC_RESOLUTION_12B;
  hadc1.Init.ScanConvMode = DISABLE;
  hadc1.Init.ContinuousConvMode = ENABLE;
  hadc1.Init.DiscontinuousConvMode = DISABLE;
  hadc1.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
  hadc1.Init.ExternalTrigConv = ADC_SOFTWARE_START;
  hadc1.Init.DataAlign = ADC_DATAALIGN_RIGHT;
  hadc1.Init.NbrOfConversion = 1;
  hadc1.Init.DMAContinuousRequests = DISABLE;
  hadc1.Init.EOCSelection = ADC_EOC_SINGLE_CONV;
  if (HAL_ADC_Init(&hadc1) != HAL_OK)
  {
    Error_Handler();
  }
  /** Configure for the selected ADC regular channel its corresponding rank in the sequencer and its sample time.
  */
  sConfig.Channel = ADC_CHANNEL_1;
  sConfig.Rank = 1;
  sConfig.SamplingTime = ADC_SAMPLETIME_3CYCLES;
  if (HAL_ADC_ConfigChannel(&hadc1, &sConfig) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN ADC1_Init 2 */

  /* USER CODE END ADC1_Init 2 */

}

/**
  * @brief USART1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_USART1_UART_Init(void)
{

  /* USER CODE BEGIN USART1_Init 0 */

  /* USER CODE END USART1_Init 0 */

  /* USER CODE BEGIN USART1_Init 1 */

  /* USER CODE END USART1_Init 1 */
  huart1.Instance = USART1;
  huart1.Init.BaudRate = 115200;
  huart1.Init.WordLength = UART_WORDLENGTH_8B;
  huart1.Init.StopBits = UART_STOPBITS_1;
  huart1.Init.Parity = UART_PARITY_NONE;
  huart1.Init.Mode = UART_MODE_TX_RX;
  huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart1.Init.OverSampling = UART_OVERSAMPLING_16;
  if (HAL_UART_Init(&huart1) != HAL_OK)
  {
    Error_Handler();
  }
  /* USER CODE BEGIN USART1_Init 2 */

  /* USER CODE END USART1_Init 2 */

}

/**
  * @brief GPIO Initialization Function
  * @param None
  * @retval None
  */
static void MX_GPIO_Init(void)
{

  /* GPIO Ports Clock Enable */
  __HAL_RCC_GPIOH_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();

}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM1 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM1) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
